src/cf/DataProcessors/УправлениеЛицензированием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УправлениеЛицензированием</Name>
			<Comment>Управление лицензированием</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Comment>Описание ошибки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОшибки</Name>
					<Comment>Код ошибки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСтарта</Name>
					<Comment>Режим старта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинКод</Name>
					<Comment>Пин-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СигнатураОборудования</Name>
					<Comment>Сигнатура оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОборудования</Name>
					<Comment>Описание оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАктивации</Name>
					<Comment>Вариант активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Comment>Электронная почта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветИнтернетАктивации</Name>
					<Comment>Ответ интернет активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОтвет</Name>
					<Comment>Переключатель запрос или ответ активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокЗапросаТелефоннойАктивации</Name>
					<Comment>Строка запроса телефонной активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>58</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации1</Name>
					<Comment>Блок ответа 1</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации2</Name>
					<Comment>Блок ответа 2</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокОтветаТелефоннойАктивации3</Name>
					<Comment>Блок ответа 3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключитьсяКВыбранномуСерверуПослеАктивации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерПакетаЛицензий</Name>
					<Comment>Регистрационный номер пакета лицензий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПакетаЛицензий</Name>
					<Comment>Пароль пакета лицензий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАктивации</Name>
					<Comment>Способ активации</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКлюча</Name>
					<Comment>Номер ключа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомерКлюча</Name>
					<Comment>Заводской номер ключа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Установщик</Name>
					<Comment>Установщик</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступаКлючаЗащиты</Name>
					<Comment>Код доступа ключа защиты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейДоОкончанияДействияКлюча</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивацииДополнительнойЛицензии</Name>
					<Comment>Дата активации дополнительной лицензии (для запроса активации)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/УправлениеЛицензированием/Forms/СостояниеСистемыЗащиты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоКлиентСервернаяБаза = Не СтрНайти(СтрокаСоединенияИнформационнойБазы(), "File=");
	
	ЧастиИмени = СтрЗаменить(ИмяФормы, ".", Символы.ПС);
	
	ИмяОбъектаОбработки = СтрПолучитьСтроку(ЧастиИмени, 1) + "." + СтрПолучитьСтроку(ЧастиИмени, 2);
	Результат = "";
	ОписаниеОшибки = "";
	
	Если ТипЗнч(Параметры.РезультатыЗапуска) = Тип("Массив") Тогда
		РезультатыЗапуска = Параметры.РезультатыЗапуска;
	Иначе	
		РезультатыЗапуска = Новый Массив;
		Для Каждого Решение Из ЛицензированиеПоддержка.СписокРешений() Цикл
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ОписаниеОшибки", "");
			ПараметрыФормы.Вставить("КодОшибки", 0);
			ПараметрыФормы.Вставить("ПрограммноеОткрытиеФормы", Истина);
			ПараметрыФормы.Вставить("ИмяОбработки", Решение.Ключ);
			ПараметрыФормы.Вставить("ИмяРешения", Решение.Значение);
			РезультатыЗапуска.Добавить(ПараметрыФормы);
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого РезультатЗапуска Из РезультатыЗапуска Цикл
		Результат = РезультатЗапуска.ОписаниеОшибки;
		КодОшибки = РезультатЗапуска.КодОшибки;
		
		Если ПустаяСтрока(Результат) Тогда
			Попытка
				Обработка = ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку(РезультатЗапуска.ИмяОбработки, Результат);
			Исключение
				Результат = ОписаниеОшибки();
			КонецПопытки;
		КонецЕсли;
		
		Если ПустаяСтрока(Результат) Тогда
			Если Обработка.Компонента.ЗащитаАктивна() Тогда
				Результат = "";
				Результат = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
			Иначе
				Элементы.КомандаАктивироватьПакетЛицензий.Доступность = Ложь;
			КонецЕсли;
		Иначе
			Элементы.КомандаАктивироватьПакетЛицензий.Доступность = Ложь;
			Результат = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
		КонецЕсли;
		Если ОписаниеОшибки <> "" Тогда
			ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Символы.ПС;	
		КонецЕсли;	
			
		ОписаниеОшибки = ОписаниеОшибки + РезультатЗапуска.ИмяРешения + Символы.ПС + Результат;
	КонецЦикла;
	
	Если ЭтоКлиентСервернаяБаза Тогда
		Элементы.КомандаУстановитьСерверЛицензирования.Доступность = Ложь;
	КонецЕсли;
	
	// {УАТ}
 	Элементы.КомандаАктивироватьПакетЛицензий.Видимость = Ложь;
 	// {/УАТ}

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СисИнфо = Новый СистемнаяИнформация;
	ЭтоWindows = СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
	Если НЕ ЭтоWindows Тогда
		Элементы.КомандаУстановитьСерверЛицензирования.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Вызов мастера активации ключа защиты
&НаКлиенте
Процедура КомандаАктивироватьКлюч(Команда)
	
	// {УАТ}
	МассивСтрок = Новый Массив();
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		МассивСтрок.Добавить(НСтр("en='Attention!';ru='Внимание!'"));           
	Иначе
		МассивСтрок.Добавить(НСтр("en='This form can be used to activate the software license key for the mobile application operating via a corporate (local) server.'
		|;ru='С помощью данной формы возможна активация программного ключа для мобильного приложения в варианте работы через корпоративный (локальный) сервер.'"));
	КонецЕсли;
	МассивСтрок.Добавить(НСтр("en='"
		"Activation of the software key for configuration is performed using the server console,"
		"which is accessible via a web browser at the address and port of the SLK server."
		"Console address on the local computer when using the standard port:"
		"';ru='"
		"Активация программного ключа для конфигурации выполняется при помощи консоли сервера, "
		"которая доступна при помощи веб браузера по адресу и порту сервера СЛК. "
		"Адрес консоли на локальном компьютере при использовании стандартного порта:"
		"'"));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("http://localhost:9099",,,,"http://localhost:9099"));
	ТекстВопроса = Новый ФорматированнаяСтрока(МассивСтрок);	
	Оповещение = Новый ОписаниеОповещения("АктивироватьКлючПродолжение", ЭтаФорма);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	// {/УАТ}

КонецПроцедуры

// Перезапуск защиты
//
// Параметры:
//  Команда - КомандаФормы - команда формы.
//
&НаКлиенте
Процедура Перезапустить(Команда)
	
	ОписаниеОшибки = "";
	
	// перезапуск защиты
	ОтключитьсяОтСервераЛицензирования();
	ОбновитьПовторноИспользуемыеЗначения();
	Ошибка = Ложь;
	ПодключитьсяКСерверуЛицензирования(Ошибка);
	
	Если НЕ Ошибка Тогда
		ОбновитьИнтерфейс();
		Закрыть(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Завершение работы.
//
// Параметры:
//  Команда - КомандаФормы - команда формы.
//
&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ЗавершитьРаботуЗавершение", ЭтотОбъект),
		НСтр("ru = 'Завершить работу системы?'; en = 'Shut down the system?'"),
		РежимДиалогаВопрос.ОКОтмена, ,
		КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

// Вызов мастера настройки сервера лицензирования.
//
// Параметры:
//  Команда - КомандаФормы - команда формы.
//
&НаКлиенте
Процедура КомандаНастройкаСервера(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНастройкиСервераЗащиты", ЭтотОбъект, Новый Структура("ПрограммноеОткрытиеФормы", Параметры.ПрограммноеОткрытиеФормы));
	ОткрытьФорму(ИмяОбъектаОбработки + ".Форма.ФормаНастройкиСервераЗащиты", , , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаАктивироватьПакетЛицензий(Команда)
	Если ВРег(ЛицензированиеСервер.АдресСервераЛицензирования()) = "*AUTO" Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'В режиме автоматического поиска сервера лицензирования невозможна активация лицензий.
		|Требуется явно указать сервер лицензирования.'; en = 'In license server automatic search mode can not activate the license.
		|Required to specify the license server.'"));
		
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыАктивацииЛицензий", ЭтотОбъект);
	ОткрытьФорму(ИмяОбъектаОбработки + ".Форма.ФормаАктивацииЛицензий", , , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСерверЛицензирования(Команда)
	
	#Если НЕ ВебКлиент Тогда
		ОбработчикОповещения = Новый ОписаниеОповещения("КомандаУстановитьСерверЛицензированияЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Сервер лицензирования конфигураций будет установлен на этом компьютере.
                          |Пользователь должен иметь права администратора компьютера.
                          |Установить?'; en = 'The license server is installed on this computer.
                          |The user must have administrator privileges computer.
                          |Start Installation?'");
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	#Иначе
		  ПоказатьПредупреждение(Неопределено, НСтр("ru = 'В веб-клиенте недоступна установка сервера защиты'; en = 'In  web-client mode,  the License server installation is unavailable'"));
		  Возврат;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнформация(Команда)
	
	ОткрытьФорму(ИмяОбъектаОбработки + ".Форма.ИнформацияОПараметрахЛицензирования", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьДистрибутивСервераЛицензирования(Команда)
	#Если НЕ ВебКлиент Тогда
		ДиалогСохранения = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохранения.Фильтр = ".msi";
		ДиалогСохранения.ПолноеИмяФайла = "LS_Setup.msi";
		ДиалогСохранения.Заголовок = НСтр("ru = 'Выберите расположение дистрибутива сервера лицензирования'; en = 'Select the location of the license server distribution'");
		
		ДиалогСохранения.Показать(Новый ОписаниеОповещения("КомандаСохранитьДистрибутивСервераЛицензированияЗавершение", ЭтотОбъект, Новый Структура("ДиалогСохранения", ДиалогСохранения)));
	#Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'В веб-клиенте недоступно сохранение сервера лицензирования'; en = 'Saving a license server is not available in the Web client'"));
		Возврат;
	#КонецЕсли
КонецПроцедуры

// Продолжение активации ключа
&НаКлиенте
Процедура АктивироватьКлючПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	// {УАТ}
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыАктивацииКлюча", ЭтотОбъект);
		ОткрытьФорму(ИмяОбъектаОбработки+".Форма.ФормаАктивацииКлючаЗащиты", , , , , , Оповещение);
	КонецЕсли;
	// {/УАТ}

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСистемуЗащиты1ССЛК(Команда)
	Оповещ = Новый ОписаниеОповещения("ПерейтиНаСистемуЗащиты1ССЛКВопрос", ЭтотОбъект);
	ПоказатьВопрос(Оповещ,
		"После изменения системы защиты программа будет автоматически перезапущена.
		|Все несохраненные изменения будут потеряны.
		|Продолжить?",
		РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСистемуЗащиты1ССЛКВопрос(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьКонстантуВариантЗащиты();
		ЗавершитьРаботуСистемы(Ложь, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКонстантуВариантЗащиты()
	Константы.уатИспользоватьПрямоеПодключениеСЛК.Установить(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки)
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		ОписаниеОшибки = НСтр("ru = 'Лицензия получена от сервера: ""'; en = 'License received from the server: ""'") + ЛицензированиеСервер.ПараметрСеансаАдресСервераЛицензирования() + """";
	КонецЕсли;
		
	//@skip-check use-non-recommended-method
	Возврат "[" + ТекущаяДата() + "]: " + ОписаниеОшибки;
КонецФункции

&НаСервере
Процедура ОтключитьсяОтСервераЛицензирования()
	ОписаниеОшибки = "";
	
	СписокРешений = ЛицензированиеПоддержка.СписокРешений();
	Для Каждого Решение Из СписокРешений Цикл
		ЛицензированиеСервер.ОсвободитьЛицензию(Решение.Ключ, ОписаниеОшибки);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла()
	ДвоичныеДанные = ПолучитьОбщийМакет("ДистрибутивСервераЛицензирования");
	Возврат ДвоичныеДанные;
КонецФункции

// Служебная функция. Зарезервировано.
&НаКлиенте
Процедура Таймаут()
	
	//@skip-check module-unused-local-variable
	Зарезервировано = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыАктивацииКлюча(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = Результат;
	
	Если ОписаниеОшибки = "" Тогда
		// перезапуск защиты
		ОбновитьПовторноИспользуемыеЗначения();
		
		ПодключитьОбработчикОжидания("Таймаут", 2, Истина);
		Ошибка = Ложь;
		ПодключитьсяКСерверуЛицензирования(Ошибка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяКСерверуЛицензирования(Ошибка = Ложь)
	СписокРешений = ЛицензированиеПоддержка.СписокРешений();
	РезультатыЗапуска = Новый Массив;
	
	Для Каждого Решение Из СписокРешений Цикл
		
		ОписаниеОшибки = "";
		КодОшибки = 0;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			
			// Повторный запуск системы лицензирования в режиме обычного приложения не дает ошибки.
			УстановитьПривилегированныйРежим(Истина);
			Если ПараметрыСеанса.ВключенаЗащитаОтОпасныхДействий = 2 Тогда
				ПараметрыСеанса.ВключенаЗащитаОтОпасныхДействий = 0;
			КонецЕсли;
			
			// Проверка и разбор длинного имени
			ИмяОбработки = Решение.Ключ;
			ИмяМакетаХранилища = "";
			ИмяМакетаПараметровЛицензирования = "";
			КороткоеИмяОбработки = "";
			Если НЕ ЛицензированиеСервер.РазделитьИмяОбработки(ИмяОбработки, ИмяМакетаХранилища, ИмяМакетаПараметровЛицензирования, КороткоеИмяОбработки) Тогда
				ОписаниеОшибки =
					НСтр("ru = 'Неверный формат имени обработки:'; en = 'Invalid name format of data processor:'")
					+ Символы.ПС
					+ ИмяОбработки;
				КодОшибки = 1;
				Возврат;
			КонецЕсли;	
			КлючПродукта = ИмяМакетаХранилища + "." + ИмяМакетаПараметровЛицензирования;
			
			Если НЕ ЛицензированиеКлиент.ВыполнитьПривязкуКлиента(КлючПродукта, ОписаниеОшибки) Тогда
				ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
				Возврат;
			КонецЕсли;
			
		#КонецЕсли
		
		РезультатОписаниеОшибки = "";
		ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Решение.Ключ, РезультатОписаниеОшибки, КодОшибки);
		Если РезультатОписаниеОшибки <> "" Тогда
			Ошибка = Истина;
		КонецЕсли;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОписаниеОшибки", РезультатОписаниеОшибки);
		ПараметрыФормы.Вставить("КодОшибки", КодОшибки);
		ПараметрыФормы.Вставить("ПрограммноеОткрытиеФормы", Истина);
		ПараметрыФормы.Вставить("ИмяОбработки", Решение.Ключ);
		ПараметрыФормы.Вставить("ИмяРешения", Решение.Значение);
		РезультатыЗапуска.Добавить(ПараметрыФормы); 
		
	КонецЦикла;
	
	Для Каждого РезультатЗапуска Из РезультатыЗапуска Цикл
		Результат = РезультатЗапуска.ОписаниеОшибки;
		КодОшибки = РезультатЗапуска.КодОшибки;
		
		Если ПустаяСтрока(Результат) Тогда
			Результат = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
		КонецЕсли;
		
		Если ОписаниеОшибки <> "" Тогда
			ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Символы.ПС;	
		КонецЕсли;	
		
		ОписаниеОшибки = ОписаниеОшибки + РезультатЗапуска.ИмяРешения + Символы.ПС + Результат;
	КонецЦикла;
	
	ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		
		Если Параметры.ПрограммноеОткрытиеФормы ИЛИ МодальныйРежим Тогда
			Закрыть(Истина);
		Иначе
			ОтключитьсяОтСервераЛицензирования();
			
			// {УАТ}  
  			// Если необходимо завершить работу платформы, то следует 
			// Закомментировать:
			Закрыть(Истина);
			// Раскомментировать:
			//ЗавершитьРаботуСистемы(Ложь);
			// {/УАТ}
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНастройкиСервераЗащиты(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат = Неопределено Тогда
		// были выполнены действия по настройке подключения к серверу
		ОписаниеОшибки = Результат;
		Если ОписаниеОшибки = "" Тогда
			// перезапуск защиты
			ОтключитьсяОтСервераЛицензирования();
			ОбновитьПовторноИспользуемыеЗначения();
			
			СписокРешений = ЛицензированиеПоддержка.СписокРешений();
			РезультатыЗапуска = Новый Массив;
			Ошибка = Ложь;
			
			АдресаСерверовЛицензирования = ЛицензированиеСервер.СписокАдресовСервераЛицензирования();
			
			КоличествоСерверов = АдресаСерверовЛицензирования.Количество();
			Сч = 1;
			Для Каждого АдресСервера Из АдресаСерверовЛицензирования Цикл
				
				ЛицензированиеСервер.УстановитьПараметрСеансаТекущийАдресСервераЛицензирования(АдресСервера);
				
				Для Каждого Решение Из СписокРешений Цикл
					
					#Если ТолстыйКлиентОбычноеПриложение Тогда
						
						ОписаниеОшибки = "";
						КодОшибки = 0;
						
						// Проверка и разбор длинного имени
						ИмяОбработки = Решение.Ключ;
						ИмяМакетаХранилища = "";
						ИмяМакетаПараметровЛицензирования = "";
						КороткоеИмяОбработки = "";
						Если НЕ ЛицензированиеСервер.РазделитьИмяОбработки(ИмяОбработки, ИмяМакетаХранилища, ИмяМакетаПараметровЛицензирования, КороткоеИмяОбработки) Тогда
							ОписаниеОшибки = НСтр("ru = 'Неверный формат имени обработки:'; en = 'Invalid name format of data processor:'") + Символы.ПС + ИмяОбработки;
							КодОшибки = 1;
							Возврат;
						КонецЕсли;	
						КлючПродукта = ИмяМакетаХранилища + "." + ИмяМакетаПараметровЛицензирования;
						
						Если НЕ ЛицензированиеКлиент.ВыполнитьПривязкуКлиента(КлючПродукта, ОписаниеОшибки) Тогда
							ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
							Возврат;
						КонецЕсли;
						
					#КонецЕсли
					
					РезультатОписаниеОшибки = "";
					КодОшибки = 0;
					ЛицензированиеСервер.НачалоРаботыСистемыЛицензирования(Решение.Ключ, РезультатОписаниеОшибки, КодОшибки);
					Если РезультатОписаниеОшибки <> "" Тогда
						Ошибка = Истина;
					КонецЕсли;
					ПараметрыФормы = Новый Структура;
					ПараметрыФормы.Вставить("ОписаниеОшибки", РезультатОписаниеОшибки);
					ПараметрыФормы.Вставить("КодОшибки", КодОшибки);
					ПараметрыФормы.Вставить("ПрограммноеОткрытиеФормы", Истина);
					ПараметрыФормы.Вставить("ИмяОбработки", Решение.Ключ);
					ПараметрыФормы.Вставить("ИмяРешения", Решение.Значение);
					РезультатыЗапуска.Добавить(ПараметрыФормы); 
					
				КонецЦикла;
				
				Для Каждого РезультатЗапуска Из РезультатыЗапуска Цикл
					Результат = РезультатЗапуска.ОписаниеОшибки;
					КодОшибки = РезультатЗапуска.КодОшибки;
					
					Если ПустаяСтрока(Результат) Тогда
						Результат = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
					КонецЕсли;
					
					Если ОписаниеОшибки <> "" Тогда
						ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Символы.ПС;	
					КонецЕсли;	
					
					ОписаниеОшибки = ОписаниеОшибки + РезультатЗапуска.ИмяРешения + Символы.ПС + Результат;
				КонецЦикла;
				
				Если ЛицензированиеСервер.ЕстьОшибкаСоединенияССервером(РезультатыЗапуска) И Сч < КоличествоСерверов Тогда
					// Если ошибка соединения с сервером, на сервере не найден ключ и список серверов не исчерпан, то пробуем
					// подключиться к другому серверу.
					РезультатыЗапуска.Очистить();
					Сч = Сч + 1;
					Продолжить;
				Иначе
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ Ошибка И Параметры.ПрограммноеОткрытиеФормы Тогда
				ОбновитьИнтерфейс();
				Закрыть(Ложь);
			Иначе
				ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыАктивацииЛицензий(Результат, ДополнительныеПараметры) Экспорт
	ОписаниеОшибки = СформироватьОписаниеСостоянияСистемыЗащиты(Результат);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСерверЛицензированияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса =  КодВозвратаДиалога.Да Тогда
		ДанныеФайла = ПолучитьДанныеФайла();
		НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("КомандаУстановитьСерверЛицензированияЗавершениеПолученияКаталогаВременныхФайлов", ЭтотОбъект, Новый Структура("ДанныеФайла", ДанныеФайла)));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСерверЛицензированияЗавершениеПолученияКаталогаВременныхФайлов(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт
	
	ДанныеФайла = ДополнительныеПараметры.ДанныеФайла;
	
	ИмяКаталога = ИмяКаталогаВременныхФайлов;
	ИмяВременногоФайла = ИмяКаталога + "setup.msi";
	
	ДанныеФайла.НачатьЗапись(Новый ОписаниеОповещения("КомандаУстановитьСерверЛицензированияЗавершениеПолученияКаталогаВременныхФайловЗавершение", ЭтотОбъект, Новый Структура("ИмяВременногоФайла", ИмяВременногоФайла)), ИмяВременногоФайла);

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСерверЛицензированияЗавершениеПолученияКаталогаВременныхФайловЗавершение(ДополнительныеПараметры1) Экспорт
	
	ИмяВременногоФайла = ДополнительныеПараметры1.ИмяВременногоФайла;
	НачатьЗапускПриложения(Новый ОписаниеОповещения("КомандаУстановитьСерверЛицензированияЗавершениеЗавершение", ЭтотОбъект), ИмяВременногоФайла);

КонецПроцедуры

// Процедура - Команда установить сервер лицензирования завершение завершение
// Необходима для возможности создать оповещение.
//
// Параметры:
//  КодВозврата - Число - Результат установки сервера лицензирования
//  ДополнительныеПараметры - Структура - Параметры для оповещения.
//
&НаКлиенте
Процедура КомандаУстановитьСерверЛицензированияЗавершениеЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	//@skip-check module-unused-local-variable
	Зарезервировано = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьДистрибутивСервераЛицензированияЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогСохранения = ДополнительныеПараметры.ДиалогСохранения;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		
		КаталогДистрибутива = ДиалогСохранения.ПолноеИмяФайла;
		
		ДанныеФайла = ПолучитьДанныеФайла();
		ДанныеФайла.НачатьЗапись(Новый ОписаниеОповещения("КомандаСохранитьДистрибутивСервераЛицензированияЗавершениеЗавершение", ЭтотОбъект, Новый Структура("КаталогДистрибутива", КаталогДистрибутива)), КаталогДистрибутива);                            
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьДистрибутивСервераЛицензированияЗавершениеЗавершение(Результат) Экспорт

	//@skip-check module-unused-local-variable
	Зарезервировано = Истина;

КонецПроцедуры

#КонецОбласти
